function verifyLogin(url) {
    let cnt = 0;
    let cookie = '';
    let r = Math.random();
    let yzm_url = getHome(url) + '/index.php/verify/index.html';
    log(`验证码链接:${yzm_url}`);
    let submit_url = getHome(url) + '/index.php/ajax/verify_check';
    log(`post登录链接:${submit_url}`);
    while (cnt < OCR_RETRY) {
        try {
            let { cookie, html } = reqCookie(yzm_url + '?r=' + r, { toBase64: true });
            let code = OcrApi.classification(html);
            log(`第${cnt + 1}次验证码识别结果:${code}`);
            html = post(submit_url, {
                headers: { Cookie: cookie },
                body: 'type=show&verify=' + code,
            });
            html = JSON.parse(html);

            if (html.code === 1) {
                log(`第${cnt + 1}次验证码提交成功`);
                log(cookie);
                return cookie // 需要返回cookie
            } else if (html.code !== 1 && cnt + 1 >= OCR_RETRY) {
                cookie = ''; // 需要清空返回cookie
            }
        } catch (e) {
            log(`第${cnt + 1}次验证码提交失败:${e.message}`);
            if (cnt + 1 >= OCR_RETRY) {
                cookie = '';
            }
        }
        cnt += 1
    }
    return cookie
}

globalThis.verifyLogin = verifyLogin;

var rule = {
    模板: 'mxpro',
    title: 'MuteFun[漫]',
    host: 'https://www.mutean.com',
    url: '/vodshow/fyclass-fyfilter.html',
    searchUrl: '/rss.xml?wd=**',
    searchable: 2, //是否启用全局搜索,
    quickSearch: 1, //是否启用快速搜索,
    filterable: 1, //是否启用分类筛选,
    filter: {
        "20": [{ "key": "剧情", "name": "剧情", "value": [{ "n": "全部", "v": "全部" }, { "n": "百合", "v": "百合" }, { "n": "校园", "v": "校园" }, { "n": "治愈", "v": "治愈" }, { "n": "恋爱", "v": "恋爱" }, { "n": "青春", "v": "青春" }, { "n": "漫改", "v": "漫改" }, { "n": "轻改", "v": "轻改" }, { "n": "原创", "v": "原创" }, { "n": "游戏改", "v": "游戏改" }, { "n": "日常", "v": "日常" }, { "n": "催泪", "v": "催泪" }, { "n": "励志", "v": "励志" }, { "n": "职场", "v": "职场" }, { "n": "萝莉", "v": "萝莉" }, { "n": "悬疑", "v": "悬疑" }, { "n": "科幻", "v": "科幻" }, { "n": "末世", "v": "末世" }, { "n": "异世界", "v": "异世界" }, { "n": "穿越", "v": "穿越" }, { "n": "纯爱", "v": "纯爱" }, { "n": "机战", "v": "机战" }, { "n": "惊悚", "v": "惊悚" }, { "n": "无下限", "v": "无下限" }, { "n": "偶像", "v": "偶像" }, { "n": "歌剧", "v": "歌剧" }, { "n": "音乐", "v": "音乐" }, { "n": "后宫", "v": "后宫" }, { "n": "战斗", "v": "战斗" }, { "n": "智斗", "v": "智斗" }, { "n": "党争", "v": "党争" }, { "n": "搞笑", "v": "搞笑" }, { "n": "重口", "v": "重口" }, { "n": "血腥", "v": "血腥" }, { "n": "龙傲天", "v": "龙傲天" }, { "n": "推理", "v": "推理" }, { "n": "治郁", "v": "治郁" }, { "n": "泡面", "v": "泡面" }, { "n": "热血", "v": "热血" }, { "n": "奇幻", "v": "奇幻" }, { "n": "冒险", "v": "冒险" }, { "n": "扭曲", "v": "扭曲" }, { "n": "胃疼", "v": "胃疼" }, { "n": "运动", "v": "运动" }, { "n": "乙女", "v": "乙女" }, { "n": "耽美", "v": "耽美" }, { "n": "腐", "v": "腐" }, { "n": "萌", "v": "萌" }] }, { "key": "地区", "name": "地区", "value": [{ "n": "全部", "v": "全部" }, { "n": "日本", "v": "日本" }] }, { "key": "语言", "name": "语言", "value": [{ "n": "全部", "v": "全部" }, { "n": "日语", "v": "日语" }] }, { "key": "年份", "name": "年份", "value": [{ "n": "全部", "v": "全部" }, { "n": "2025", "v": "2025" }, { "n": "2024", "v": "2024" }, { "n": "2023", "v": "2023" }, { "n": "2022", "v": "2022" }, { "n": "2021", "v": "2021" }, { "n": "2020", "v": "2020" }, { "n": "2019", "v": "2019" }, { "n": "2018", "v": "2018" }, { "n": "2017", "v": "2017" }, { "n": "2016", "v": "2016" }, { "n": "2015", "v": "2015" }, { "n": "2014", "v": "2014" }, { "n": "2013", "v": "2013" }, { "n": "2012", "v": "2012" }, { "n": "2011", "v": "2011" }, { "n": "2010", "v": "2010" }, { "n": "2009", "v": "2009" }, { "n": "2008", "v": "2008" }, { "n": "2007", "v": "2007" }, { "n": "2006", "v": "2006" }, { "n": "2005", "v": "2005" }, { "n": "2004", "v": "2004" }, { "n": "2003", "v": "2003" }, { "n": "2002", "v": "2002" }, { "n": "2001", "v": "2001" }, { "n": "2000", "v": "2000" }, { "n": "1999", "v": "1999" }, { "n": "1998", "v": "1998" }, { "n": "1997", "v": "1997" }, { "n": "1996", "v": "1996" }, { "n": "1995", "v": "1995" }, { "n": "1994", "v": "1994" }, { "n": "1993", "v": "1993" }, { "n": "1992", "v": "1992" }, { "n": "1991", "v": "1991" }, { "n": "1990", "v": "1990" }, { "n": "1989", "v": "1989" }, { "n": "1988", "v": "1988" }, { "n": "1987", "v": "1987" }, { "n": "1986", "v": "1986" }, { "n": "1985", "v": "1985" }, { "n": "1984", "v": "1984" }] }, { "key": "字母", "name": "字母", "value": [{ "n": "字母", "v": "字母" }, { "n": "A", "v": "A" }, { "n": "B", "v": "B" }, { "n": "C", "v": "C" }, { "n": "D", "v": "D" }, { "n": "E", "v": "E" }, { "n": "F", "v": "F" }, { "n": "G", "v": "G" }, { "n": "H", "v": "H" }, { "n": "I", "v": "I" }, { "n": "J", "v": "J" }, { "n": "K", "v": "K" }, { "n": "L", "v": "L" }, { "n": "M", "v": "M" }, { "n": "N", "v": "N" }, { "n": "O", "v": "O" }, { "n": "P", "v": "P" }, { "n": "Q", "v": "Q" }, { "n": "R", "v": "R" }, { "n": "S", "v": "S" }, { "n": "T", "v": "T" }, { "n": "U", "v": "U" }, { "n": "V", "v": "V" }, { "n": "W", "v": "W" }, { "n": "X", "v": "X" }, { "n": "Y", "v": "Y" }, { "n": "Z", "v": "Z" }, { "n": "0-9", "v": "0-9" }] }, { "key": "排序", "name": "排序", "value": [{ "n": "时间排序", "v": "time" }, { "n": "人气排序", "v": "hits" }, { "n": "评分排序", "v": "score" }] }],
        "22": [{ "key": "剧情", "name": "剧情", "value": [{ "n": "全部", "v": "全部" }, { "n": "科幻", "v": "科幻" }, { "n": "搞笑", "v": "搞笑" }, { "n": "猎奇", "v": "猎奇" }, { "n": "脑洞", "v": "脑洞" }, { "n": "战斗", "v": "战斗" }, { "n": "动作", "v": "动作" }, { "n": "冒险", "v": "冒险" }, { "n": "治愈", "v": "治愈" }, { "n": "奇幻", "v": "奇幻" }, { "n": "暴力", "v": "暴力" }] }, { "key": "地区", "name": "地区", "value": [{ "n": "全部", "v": "全部" }, { "n": "美国", "v": "美国" }] }, { "key": "语言", "name": "语言", "value": [{ "n": "全部", "v": "全部" }, { "n": "英语", "v": "英语" }] }, { "key": "年份", "name": "年份", "value": [{ "n": "全部", "v": "全部" }, { "n": "2024", "v": "2024" }, { "n": "2023", "v": "2023" }, { "n": "2022", "v": "2022" }, { "n": "2021", "v": "2021" }, { "n": "2020", "v": "2020" }, { "n": "2019", "v": "2019" }, { "n": "2018", "v": "2018" }, { "n": "2017", "v": "2017" }, { "n": "2016", "v": "2016" }, { "n": "2015", "v": "2015" }, { "n": "2014", "v": "2014" }, { "n": "2013", "v": "2013" }, { "n": "2012", "v": "2012" }, { "n": "2011", "v": "2011" }, { "n": "2010", "v": "2010" }, { "n": "2009", "v": "2009" }, { "n": "2008", "v": "2008" }, { "n": "2007", "v": "2007" }, { "n": "2006", "v": "2006" }, { "n": "2005", "v": "2005" }, { "n": "2004", "v": "2004" }, { "n": "2003", "v": "2003" }, { "n": "2002", "v": "2002" }, { "n": "2001", "v": "2001" }, { "n": "2000", "v": "2000" }, { "n": "1999", "v": "1999" }, { "n": "1998", "v": "1998" }, { "n": "1997", "v": "1997" }, { "n": "1996", "v": "1996" }, { "n": "1995", "v": "1995" }, { "n": "1994", "v": "1994" }, { "n": "1993", "v": "1993" }] }, { "key": "字母", "name": "字母", "value": [{ "n": "字母", "v": "字母" }, { "n": "A", "v": "A" }, { "n": "B", "v": "B" }, { "n": "C", "v": "C" }, { "n": "D", "v": "D" }, { "n": "E", "v": "E" }, { "n": "F", "v": "F" }, { "n": "G", "v": "G" }, { "n": "H", "v": "H" }, { "n": "I", "v": "I" }, { "n": "J", "v": "J" }, { "n": "K", "v": "K" }, { "n": "L", "v": "L" }, { "n": "M", "v": "M" }, { "n": "N", "v": "N" }, { "n": "O", "v": "O" }, { "n": "P", "v": "P" }, { "n": "Q", "v": "Q" }, { "n": "R", "v": "R" }, { "n": "S", "v": "S" }, { "n": "T", "v": "T" }, { "n": "U", "v": "U" }, { "n": "V", "v": "V" }, { "n": "W", "v": "W" }, { "n": "X", "v": "X" }, { "n": "Y", "v": "Y" }, { "n": "Z", "v": "Z" }, { "n": "0-9", "v": "0-9" }] }, { "key": "排序", "name": "排序", "value": [{ "n": "时间排序", "v": "time" }, { "n": "人气排序", "v": "hits" }, { "n": "评分排序", "v": "score" }] }],
        "23": [{ "key": "剧情", "name": "剧情", "value": [{ "n": "全部", "v": "全部" }, { "n": "动作", "v": "动作" }, { "n": "奇幻", "v": "奇幻" }, { "n": "科幻", "v": "科幻" }] }, { "key": "年份", "name": "年份", "value": [{ "n": "全部", "v": "全部" }, { "n": "2024", "v": "2024" }, { "n": "2023", "v": "2023" }, { "n": "2022", "v": "2022" }, { "n": "2021", "v": "2021" }, { "n": "2020", "v": "2020" }, { "n": "2019", "v": "2019" }, { "n": "2018", "v": "2018" }, { "n": "2017", "v": "2017" }, { "n": "2016", "v": "2016" }, { "n": "2015", "v": "2015" }, { "n": "2014", "v": "2014" }, { "n": "2013", "v": "2013" }, { "n": "2012", "v": "2012" }, { "n": "2011", "v": "2011" }, { "n": "2010", "v": "2010" }, { "n": "2009", "v": "2009" }, { "n": "2008", "v": "2008" }, { "n": "2007", "v": "2007" }, { "n": "2006", "v": "2006" }, { "n": "2005", "v": "2005" }, { "n": "2004", "v": "2004" }, { "n": "2003", "v": "2003" }, { "n": "2002", "v": "2002" }, { "n": "2001", "v": "2001" }, { "n": "2000", "v": "2000" }] }, { "key": "字母", "name": "字母", "value": [{ "n": "字母", "v": "字母" }, { "n": "A", "v": "A" }, { "n": "B", "v": "B" }, { "n": "C", "v": "C" }, { "n": "D", "v": "D" }, { "n": "E", "v": "E" }, { "n": "F", "v": "F" }, { "n": "G", "v": "G" }, { "n": "H", "v": "H" }, { "n": "I", "v": "I" }, { "n": "J", "v": "J" }, { "n": "K", "v": "K" }, { "n": "L", "v": "L" }, { "n": "M", "v": "M" }, { "n": "N", "v": "N" }, { "n": "O", "v": "O" }, { "n": "P", "v": "P" }, { "n": "Q", "v": "Q" }, { "n": "R", "v": "R" }, { "n": "S", "v": "S" }, { "n": "T", "v": "T" }, { "n": "U", "v": "U" }, { "n": "V", "v": "V" }, { "n": "W", "v": "W" }, { "n": "X", "v": "X" }, { "n": "Y", "v": "Y" }, { "n": "Z", "v": "Z" }, { "n": "0-9", "v": "0-9" }] }, { "key": "排序", "name": "排序", "value": [{ "n": "时间排序", "v": "time" }, { "n": "人气排序", "v": "hits" }, { "n": "评分排序", "v": "score" }] }],
        "24": [{ "key": "剧情", "name": "剧情", "value": [{ "n": "全部", "v": "全部" }, { "n": "校园", "v": "校园" }, { "n": "治愈", "v": "治愈" }, { "n": "搞笑", "v": "搞笑" }, { "n": "日常", "v": "日常" }, { "n": "萝莉", "v": "萝莉" }, { "n": "萌", "v": "萌" }, { "n": "动作", "v": "动作" }, { "n": "奇幻", "v": "奇幻" }] }, { "key": "地区", "name": "地区", "value": [{ "n": "全部", "v": "全部" }, { "n": "日本", "v": "日本" }] }, { "key": "语言", "name": "语言", "value": [{ "n": "全部", "v": "全部" }, { "n": "日语", "v": "日语" }] }, { "key": "年份", "name": "年份", "value": [{ "n": "全部", "v": "全部" }, { "n": "2024", "v": "2024" }, { "n": "2023", "v": "2023" }, { "n": "2022", "v": "2022" }, { "n": "2021", "v": "2021" }, { "n": "2020", "v": "2020" }] }, { "key": "字母", "name": "字母", "value": [{ "n": "字母", "v": "字母" }, { "n": "A", "v": "A" }, { "n": "B", "v": "B" }, { "n": "C", "v": "C" }, { "n": "D", "v": "D" }, { "n": "E", "v": "E" }, { "n": "F", "v": "F" }, { "n": "G", "v": "G" }, { "n": "H", "v": "H" }, { "n": "I", "v": "I" }, { "n": "J", "v": "J" }, { "n": "K", "v": "K" }, { "n": "L", "v": "L" }, { "n": "M", "v": "M" }, { "n": "N", "v": "N" }, { "n": "O", "v": "O" }, { "n": "P", "v": "P" }, { "n": "Q", "v": "Q" }, { "n": "R", "v": "R" }, { "n": "S", "v": "S" }, { "n": "T", "v": "T" }, { "n": "U", "v": "U" }, { "n": "V", "v": "V" }, { "n": "W", "v": "W" }, { "n": "X", "v": "X" }, { "n": "Y", "v": "Y" }, { "n": "Z", "v": "Z" }, { "n": "0-9", "v": "0-9" }] }, { "key": "排序", "name": "排序", "value": [{ "n": "时间排序", "v": "time" }, { "n": "人气排序", "v": "hits" }, { "n": "评分排序", "v": "score" }] }]
    },
    filter_url: '{{fl.地区}}-{{fl.排序}}-{{fl.剧情}}-{{fl.语言}}-{{fl.字母}}---fypage---{{fl.年份}}',
    cate_exclude: '今日更新|追更周表|APP',
    lazy: `js:
        var html = JSON.parse(request(input).match(/r player_.*?=(.*?)</)[1]);
        var url = html.url;
        var from = html.from;
        var MacPlayerConfig={};
        if (html.encrypt == '1') {
            url = unescape(url)
        } else if (html.encrypt == '2') {
            url = unescape(base64Decode(url))
        }
        if (/.m3u8|.mp4/.test(url)) {
            input = url
        } else {
        eval(fetch(HOST + '/static/js/playerconfig.js').replace('var Mac','Mac'));
        var list = MacPlayerConfig.player_list[from].parse;
            input={
                jx:0,
                url:list+url,
                parse:1,
                header: JSON.stringify({
                    'referer': HOST
                })
            }
        }
     `,
    tab_rename: { '排序': 'LR' },
    一级二: muban.mxpro.一级,
    一级: $js.toString(() => {
        let cookie = getItem(RULE_CK, '');
        //log('储存的cookie:' + cookie);        
        let ret = request(MY_URL, {
            headers: {
                Referer: encodeUrl(MY_URL),
                Cookie: cookie,
            }
        });
        if (/系统安全验证/.test(ret)) {
            //log(ret);
            cookie = verifyLogin(MY_URL);
            if (cookie) {
                log(`本次成功过验证,cookie:${cookie}`);
                setItem(RULE_CK, cookie);
            } else {
                log(`本次验证失败,cookie:${cookie}`);
            }
            ret = request(MY_URL, {
                headers: {
                    Referer: encodeUrl(MY_URL),
                    Cookie: cookie,
                }
            });
        }
        //log(ret);
        let d = [];
        let p = rule.一级二.split(';');
        let arr = pdfa(ret, p[0]);//列表
        arr.forEach(it => {
            d.push({
                title: pdfh(it, p[1]),//标题
                pic_url: pdfh(it, p[2]),//图片
                desc: pdfh(it, p[3]),//描述
                url: pdfh(it, p[4]),//链接

            });

        });
        setResult(d);
    }),
    搜索: $js.toString(() => {
        let html = post(input.split('?')[0], { body: input.split('?')[1] });
        let items = pdfa(html, 'rss&&item');
        // log(items);
        let d = [];
        items.forEach(it => {
            it = it.replace(/title|link|author|pubdate|description/g, 'p');
            let url = pdfh(it, 'p:eq(1)&&Text');
            url = url.replace(/cc/g, 'me');
            d.push({
                title: pdfh(it, 'p&&Text'),
                url: url,
                desc: pdfh(it, 'p:eq(3)&&Text'),
                content: pdfh(it, 'p:eq(2)&&Text'),
                pic_url: "",
            });
        });
        setResult(d);
    }),
}