var rule = {
	title: '多瑙影院',
	host: 'https://www.duonaovod.com',
	url: '/index.php/vod/showfyfilter.html',
	filterable: 1,//是否启用分类筛选,
	filter_url: '{{fl.地区}}{{fl.分类}}/page/fypage{{fl.年代}}',
	filter: {
		"1": [{ "key": "分类", "name": "分类：", "value": [{ "n": "全部", "v": "" }, { "n": "动作片", "v": "/id/6" }, { "n": "喜剧片", "v": "/id/7" }, { "n": "爱情片", "v": "/id/8" }, { "n": "科幻片", "v": "/id/9" }, { "n": "恐怖片", "v": "/id/10" }, { "n": "剧情片", "v": "/id/11" }, { "n": "奇幻片", "v": "/id/30" }, { "n": "战争片", "v": "/id/12" }, { "n": "犯罪片", "v": "/id/54" }, { "n": "动漫电影", "v": "/id/55" }, { "n": "伦理片", "v": "/id/34" }] }, { "key": "地区", "name": "地区：", "value": [{ "n": "全部", "v": "" }, { "n": "大陆", "v": "/area/大陆" }, { "n": "香港", "v": "/area/香港" }, { "n": "台湾", "v": "/area/台湾" }, { "n": "美国", "v": "/area/美国" }, { "n": "法国", "v": "/area/法国" }, { "n": "英国", "v": "/area/英国" }, { "n": "日本", "v": "/area/日本" }, { "n": "韩国", "v": "/area/韩国" }, { "n": "德国", "v": "/area/德国" }, { "n": "泰国", "v": "/area/泰国" }, { "n": "印度", "v": "/area/印度" }, { "n": "意大利", "v": "/area/意大利" }, { "n": "西班牙", "v": "/area/西班牙" }, { "n": "加拿大", "v": "/area/加拿大" }, { "n": "其他", "v": "/area/其他" }] }, { "key": "年代", "name": "年代：", "value": [{ "n": "全部", "v": "" }, { "n": "2025", "v": "/year/2025" }, { "n": "2024", "v": "/year/2024" }, { "n": "2023", "v": "/year/2023" }, { "n": "2022", "v": "/year/2022" }, { "n": "2021", "v": "/year/2021" }, { "n": "2020", "v": "/year/2020" }, { "n": "2019", "v": "/year/2019" }, { "n": "2018", "v": "/year/2018" }, { "n": "2017", "v": "/year/2017" }, { "n": "2016", "v": "/year/2016" }, { "n": "2015", "v": "/year/2015" }, { "n": "2014", "v": "/year/2014" }, { "n": "2013", "v": "/year/2013" }, { "n": "2012", "v": "/year/2012" }, { "n": "2011", "v": "/year/2011" }, { "n": "2010", "v": "/year/2010" }, { "n": "2009", "v": "/year/2009" }, { "n": "2008", "v": "/year/2008" }, { "n": "2006", "v": "/year/2006" }, { "n": "2005", "v": "/year/2005" }, { "n": "2004", "v": "/year/2004" }] }],
		"2": [{ "key": "分类", "name": "分类：", "value": [{ "n": "全部", "v": "" }, { "n": "国产剧", "v": "/id/13" }, { "n": "港台剧", "v": "/id/14" }, { "n": "日韩剧", "v": "/id/15" }, { "n": "欧美剧", "v": "/id/16" }, { "n": "海外剧", "v": "/id/31" }, { "n": "纪录片", "v": "/id/20" }] }, { "key": "地区", "name": "地区：", "value": [{ "n": "全部", "v": "" }, { "n": "内地", "v": "/area/内地" }, { "n": "韩国", "v": "/area/韩国" }, { "n": "香港", "v": "/area/香港" }, { "n": "台湾", "v": "/area/台湾" }, { "n": "日本", "v": "/area/日本" }, { "n": "美国", "v": "/area/美国" }, { "n": "泰国", "v": "/area/泰国" }, { "n": "英国", "v": "/area/英国" }, { "n": "新加坡", "v": "/area/新加坡" }, { "n": "其他", "v": "/area/其他" }] }, { "key": "年代", "name": "年代：", "value": [{ "n": "全部", "v": "" }, { "n": "2025", "v": "/year/2025" }, { "n": "2024", "v": "/year/2024" }, { "n": "2023", "v": "/year/2023" }, { "n": "2022", "v": "/year/2022" }, { "n": "2021", "v": "/year/2021" }, { "n": "2020", "v": "/year/2020" }, { "n": "2019", "v": "/year/2019" }, { "n": "2018", "v": "/year/2018" }, { "n": "2017", "v": "/year/2017" }, { "n": "2016", "v": "/year/2016" }, { "n": "2015", "v": "/year/2015" }, { "n": "2014", "v": "/year/2014" }, { "n": "2013", "v": "/year/2013" }, { "n": "2012", "v": "/year/2012" }, { "n": "2011", "v": "/year/2011" }, { "n": "2010", "v": "/year/2010" }, { "n": "2009", "v": "/year/2009" }, { "n": "2008", "v": "/year/2008" }, { "n": "2006", "v": "/year/2006" }, { "n": "2005", "v": "/year/2005" }, { "n": "2004", "v": "/year/2004" }] }],
		"3": [{ "key": "分类", "name": "分类：", "value": [{ "n": "全部", "v": "" }, { "n": "国产综艺", "v": "/id/27" }, { "n": "日韩综艺", "v": "/id/28" }, { "n": "欧美综艺", "v": "/id/29" }] }, { "key": "地区", "name": "地区：", "value": [{ "n": "全部", "v": "" }, { "n": "内地", "v": "/area/内地" }, { "n": "港台", "v": "/area/港台" }, { "n": "日韩", "v": "/area/日韩" }, { "n": "欧美", "v": "/area/欧美" }] }, { "key": "年代", "name": "年代：", "value": [{ "n": "全部", "v": "" }, { "n": "2025", "v": "/year/2025" }, { "n": "2024", "v": "/year/2024" }, { "n": "2023", "v": "/year/2023" }, { "n": "2022", "v": "/year/2022" }, { "n": "2021", "v": "/year/2021" }, { "n": "2020", "v": "/year/2020" }, { "n": "2019", "v": "/year/2019" }, { "n": "2018", "v": "/year/2018" }, { "n": "2017", "v": "/year/2017" }, { "n": "2016", "v": "/year/2016" }, { "n": "2015", "v": "/year/2015" }, { "n": "2014", "v": "/year/2014" }, { "n": "2013", "v": "/year/2013" }, { "n": "2012", "v": "/year/2012" }, { "n": "2011", "v": "/year/2011" }, { "n": "2010", "v": "/year/2010" }, { "n": "2009", "v": "/year/2009" }, { "n": "2008", "v": "/year/2008" }, { "n": "2006", "v": "/year/2006" }, { "n": "2005", "v": "/year/2005" }, { "n": "2004", "v": "/year/2004" }] }],
		"4": [{ "key": "分类", "name": "分类：", "value": [{ "n": "全部", "v": "" }, { "n": "国产动漫", "v": "/id/24" }, { "n": "日韩动漫", "v": "/id/25" }, { "n": "欧美动漫", "v": "/id/26" }] }, { "key": "地区", "name": "地区：", "value": [{ "n": "全部", "v": "" }, { "n": "国产", "v": "/area/国产" }, { "n": "日本", "v": "/area/日本" }, { "n": "欧美", "v": "/area/欧美" }, { "n": "其他", "v": "/area/其他" }] }, { "key": "年代", "name": "年代：", "value": [{ "n": "全部", "v": "" }, { "n": "2025", "v": "/year/2025" }, { "n": "2024", "v": "/year/2024" }, { "n": "2023", "v": "/year/2023" }, { "n": "2022", "v": "/year/2022" }, { "n": "2021", "v": "/year/2021" }, { "n": "2020", "v": "/year/2020" }, { "n": "2019", "v": "/year/2019" }, { "n": "2018", "v": "/year/2018" }, { "n": "2017", "v": "/year/2017" }, { "n": "2016", "v": "/year/2016" }, { "n": "2015", "v": "/year/2015" }, { "n": "2014", "v": "/year/2014" }, { "n": "2013", "v": "/year/2013" }, { "n": "2012", "v": "/year/2012" }, { "n": "2011", "v": "/year/2011" }, { "n": "2010", "v": "/year/2010" }, { "n": "2009", "v": "/year/2009" }, { "n": "2008", "v": "/year/2008" }, { "n": "2006", "v": "/year/2006" }, { "n": "2005", "v": "/year/2005" }, { "n": "2004", "v": "/year/2004" }] }]
	},
	filter_def: {1: { 分类: '/id/1'},2: { 分类: '/id/2'},3: { 分类: '/id/3'},4: { 分类: '/id/4'}},
	searchUrl: '/index.php/vod/search/page/fypage/wd/**.html',
	searchable: 2,//是否启用全局搜索,
	quickSearch: 0,//是否启用快速搜索,
	headers: {
		'User-Agent': 'MOBILE_UA'
	},
	class_parse: 'ul.nav li:gt(0):lt(5);a&&Text;a&&href;.*/(\\d+).html',
	play_parse: true,
	lazy: `js:
        var html = JSON.parse(request(input).match(/r player_.*?=(.*?)</)[1]);
        var url = html.url;
        if (html.encrypt == '1') {
            url = unescape(url)
        } else if (html.encrypt == '2') {
            url = unescape(base64Decode(url))
        }
        if (/\\.m3u8|\\.mp4/.test(url)) {
            input = {
                jx: 0,
                url: url,
                parse: 0
            }
        } else {
            input
        }
    `,
	limit: 6,
	推荐: '*',
	一级: '.mycol-xl-15;.text-dark&&Text;.lazy&&src;.text-truncate:eq(1)&&Text;.p-0 a&&href',
	二级: {
		"title": "h1&&Text;.mb-2&&Text",
		"img": ".lazy&&src",
		"desc": ".mb-2:eq(4)&&Text;.mb-2:eq(1)&&Text;.mb-2:eq(2)&&Text;.text-secondary:eq(1)&&Text;.mb-2:eq(5)&&Text",
		"content": ".text-secondary:eq(2)&&Text",
		"tabs": ".playlists dt",
		"lists": ".playlist.mod.clearfix:eq(#id) a"
	},
	搜索: '*',
}