var rule = {
    类型: '影视',
    title: '思古影视',
    host: 'https://siguyy.cn',
    url: '/show/fyclass-fyfilter/',
    searchUrl: '/search/**----------fypage---/',
    searchable: 2,
    quickSearch: 0,
    timeout: 5000,
    play_parse: true,
    filterable: 1,
    class_name: '电影&电视剧&综艺&动漫&短剧',
    class_url: '1&2&3&4&24',
    filter: {
        '1': [{ key: '排序', name: '排序', value: [{ n: '新上线 ', v: 'time', }, { n: '热播榜 ', v: 'hits', }, { n: '好评榜 ', v: 'score', },], }, { key: '剧情', name: '剧情', value: [{ n: '全部剧情 ', v: '', }, { n: '喜剧 ', v: '喜剧', }, { n: '爱情 ', v: '爱情', }, { n: '恐怖 ', v: '恐怖', }, { n: '动作 ', v: '动作', }, { n: '科幻 ', v: '科幻', }, { n: '剧情 ', v: '剧情', }, { n: '战争 ', v: '战争', }, { n: '犯罪 ', v: '犯罪', }, { n: '动画 ', v: '动画', }, { n: '奇幻 ', v: '奇幻', }, { n: '武侠 ', v: '武侠', }, { n: '冒险 ', v: '冒险', }, { n: '恐怖 ', v: '恐怖', }, { n: '悬疑 ', v: '悬疑', }, { n: '惊悚 ', v: '惊悚', }, { n: '微电影 ', v: '微电影', }, { n: '古装 ', v: '古装', }, { n: '历史 ', v: '历史', }, { n: '儿童 ', v: '儿童', },], }, { key: '地区', name: '地区', value: [{ n: '全部地区 ', v: '', }, { n: '大陆 ', v: '大陆', }, { n: '香港 ', v: '香港', }, { n: '台湾 ', v: '台湾', }, { n: '美国 ', v: '美国', }, { n: '法国 ', v: '法国', }, { n: '英国 ', v: '英国', }, { n: '日本 ', v: '日本', }, { n: '韩国 ', v: '韩国', }, { n: '印度 ', v: '印度', },], }, { key: '年份', name: '年份', value: [{ n: '全部年份 ', v: '', }, { n: '2024 ', v: '2024', }, { n: '2023 ', v: '2023', }, { n: '2022 ', v: '2022', }, { n: '2021 ', v: '2021', }, { n: '2020 ', v: '2020', }, { n: '2019 ', v: '2019', }, { n: '2018 ', v: '2018', }, { n: '2017 ', v: '2017', }, { n: '2016 ', v: '2016', }, { n: '2015 ', v: '2015', }, { n: '2014 ', v: '2014', }, { n: '2013 ', v: '2013', }, { n: '2012 ', v: '2012', },], }, { key: '字母', name: '字母', value: [{ n: '字母查找 ', v: '', }, { n: 'A ', v: 'A', }, { n: 'B ', v: 'B', }, { n: 'C ', v: 'C', }, { n: 'D ', v: 'D', }, { n: 'E ', v: 'E', }, { n: 'F ', v: 'F', }, { n: 'G ', v: 'G', }, { n: 'H ', v: 'H', }, { n: 'I ', v: 'I', }, { n: 'J ', v: 'J', }, { n: 'K ', v: 'K', }, { n: 'L ', v: 'L', }, { n: 'M ', v: 'M', }, { n: 'N ', v: 'N', }, { n: 'O ', v: 'O', }, { n: 'P ', v: 'P', }, { n: 'Q ', v: 'Q', }, { n: 'R ', v: 'R', }, { n: 'S ', v: 'S', }, { n: 'T ', v: 'T', }, { n: 'U ', v: 'U', }, { n: 'V ', v: 'V', }, { n: 'W ', v: 'W', }, { n: 'X ', v: 'X', }, { n: 'Y ', v: 'Y', }, { n: 'Z ', v: 'Z', }, { n: '0-9 ', v: '0', },], },],
        '2': [{ key: '排序', name: '排序', value: [{ n: '新上线 ', v: 'time', }, { n: '热播榜 ', v: 'hits', }, { n: '好评榜 ', v: 'score', },], }, { key: '剧情', name: '剧情', value: [{ n: '全部剧情 ', v: '', }, { n: '古装 ', v: '古装', }, { n: '青春 ', v: '青春', }, { n: '偶像 ', v: '偶像', }, { n: '喜剧 ', v: '喜剧', }, { n: '家庭 ', v: '家庭', }, { n: '犯罪 ', v: '犯罪', }, { n: '动作 ', v: '动作', }, { n: '剧情 ', v: '剧情', }, { n: '历史 ', v: '历史', }, { n: '情景 ', v: '情景', }, { n: '商战 ', v: '商战', }, { n: '网剧 ', v: '网剧', },], }, { key: '地区', name: '地区', value: [{ n: '全部地区 ', v: '', }, { n: '大陆 ', v: '大陆', }, { n: '韩国 ', v: '韩国', }, { n: '香港 ', v: '香港', }, { n: '台湾 ', v: '台湾', }, { n: '日本 ', v: '日本', }, { n: '美国 ', v: '美国', }, { n: '泰国 ', v: '泰国', },], }, { key: '年份', name: '年份', value: [{ n: '全部年份 ', v: '', }, { n: '2024 ', v: '2024', }, { n: '2023 ', v: '2023', }, { n: '2022 ', v: '2022', }, { n: '2021 ', v: '2021', }, { n: '2020 ', v: '2020', }, { n: '2019 ', v: '2019', }, { n: '2018 ', v: '2018', }, { n: '2017 ', v: '2017', }, { n: '2016 ', v: '2016', }, { n: '2015 ', v: '2015', }, { n: '2014 ', v: '2014', }, { n: '2013 ', v: '2013', }, { n: '2012 ', v: '2012', },], }, { key: '字母', name: '字母', value: [{ n: '字母查找 ', v: '', }, { n: 'A ', v: 'A', }, { n: 'B ', v: 'B', }, { n: 'C ', v: 'C', }, { n: 'D ', v: 'D', }, { n: 'E ', v: 'E', }, { n: 'F ', v: 'F', }, { n: 'G ', v: 'G', }, { n: 'H ', v: 'H', }, { n: 'I ', v: 'I', }, { n: 'J ', v: 'J', }, { n: 'K ', v: 'K', }, { n: 'L ', v: 'L', }, { n: 'M ', v: 'M', }, { n: 'N ', v: 'N', }, { n: 'O ', v: 'O', }, { n: 'P ', v: 'P', }, { n: 'Q ', v: 'Q', }, { n: 'R ', v: 'R', }, { n: 'S ', v: 'S', }, { n: 'T ', v: 'T', }, { n: 'U ', v: 'U', }, { n: 'V ', v: 'V', }, { n: 'W ', v: 'W', }, { n: 'X ', v: 'X', }, { n: 'Y ', v: 'Y', }, { n: 'Z ', v: 'Z', }, { n: '0-9 ', v: '0', },], },],
        '3': [{ key: '排序', name: '排序', value: [{ n: '新上线 ', v: 'time', }, { n: '热播榜 ', v: 'hits', }, { n: '好评榜 ', v: 'score', },], }, { key: '剧情', name: '剧情', value: [{ n: '全部剧情 ', v: '', }, { n: '选秀 ', v: '选秀', }, { n: '情感 ', v: '情感', }, { n: '访谈 ', v: '访谈', }, { n: '音乐 ', v: '音乐', }, { n: '美食 ', v: '美食', }, { n: '曲艺 ', v: '曲艺', }, { n: '生活 ', v: '生活', },], }, { key: '地区', name: '地区', value: [{ n: '全部地区 ', v: '', }, { n: '大陆 ', v: '大陆', }, { n: '香港 ', v: '香港', }, { n: '韩国 ', v: '韩国', }, { n: '日本 ', v: '日本', }, { n: '台湾 ', v: '台湾', }, { n: '美国 ', v: '美国', },], }, { key: '年份', name: '年份', value: [{ n: '全部年份 ', v: '', }, { n: '2024 ', v: '2024', }, { n: '2023 ', v: '2023', }, { n: '2022 ', v: '2022', }, { n: '2021 ', v: '2021', }, { n: '2020 ', v: '2020', }, { n: '2019 ', v: '2019', }, { n: '2018 ', v: '2018', }, { n: '2017 ', v: '2017', }, { n: '2016 ', v: '2016', }, { n: '2015 ', v: '2015', }, { n: '2014 ', v: '2014', }, { n: '2013 ', v: '2013', }, { n: '2012 ', v: '2012', },], }, { key: '字母', name: '字母', value: [{ n: '字母查找 ', v: '', }, { n: 'A ', v: 'A', }, { n: 'B ', v: 'B', }, { n: 'C ', v: 'C', }, { n: 'D ', v: 'D', }, { n: 'E ', v: 'E', }, { n: 'F ', v: 'F', }, { n: 'G ', v: 'G', }, { n: 'H ', v: 'H', }, { n: 'I ', v: 'I', }, { n: 'J ', v: 'J', }, { n: 'K ', v: 'K', }, { n: 'L ', v: 'L', }, { n: 'M ', v: 'M', }, { n: 'N ', v: 'N', }, { n: 'O ', v: 'O', }, { n: 'P ', v: 'P', }, { n: 'Q ', v: 'Q', }, { n: 'R ', v: 'R', }, { n: 'S ', v: 'S', }, { n: 'T ', v: 'T', }, { n: 'U ', v: 'U', }, { n: 'V ', v: 'V', }, { n: 'W ', v: 'W', }, { n: 'X ', v: 'X', }, { n: 'Y ', v: 'Y', }, { n: 'Z ', v: 'Z', }, { n: '0-9 ', v: '0', },], },],
        '4': [{ key: '排序', name: '排序', value: [{ n: '新上线 ', v: 'time', }, { n: '热播榜 ', v: 'hits', }, { n: '好评榜 ', v: 'score', },], }, { key: '剧情', name: '剧情', value: [{ n: '全部剧情 ', v: '', }, { n: '科幻 ', v: '科幻', }, { n: '热血 ', v: '热血', }, { n: '推理 ', v: '推理', }, { n: '搞笑 ', v: '搞笑', }, { n: '冒险 ', v: '冒险', }, { n: '校园 ', v: '校园', }, { n: '动作 ', v: '动作', }, { n: '机战 ', v: '机战', }, { n: '运动 ', v: '运动', }, { n: '少女 ', v: '少女', }, { n: '社会 ', v: '社会', }, { n: '原创 ', v: '原创', }, { n: '亲子 ', v: '亲子', }, { n: '益智 ', v: '益智', }, { n: '励志 ', v: '励志', },], }, { key: '地区', name: '地区', value: [{ n: '全部地区 ', v: '', }, { n: '大陆 ', v: '大陆', }, { n: '日本 ', v: '日本', }, { n: '台湾 ', v: '台湾', }, { n: '美国 ', v: '美国', },], }, { key: '年份', name: '年份', value: [{ n: '全部年份 ', v: '', }, { n: '2024 ', v: '2024', }, { n: '2023 ', v: '2023', }, { n: '2022 ', v: '2022', }, { n: '2021 ', v: '2021', }, { n: '2020 ', v: '2020', }, { n: '2019 ', v: '2019', }, { n: '2018 ', v: '2018', }, { n: '2017 ', v: '2017', }, { n: '2016 ', v: '2016', }, { n: '2015 ', v: '2015', }, { n: '2014 ', v: '2014', }, { n: '2013 ', v: '2013', }, { n: '2012 ', v: '2012', },], }, { key: '字母', name: '字母', value: [{ n: '字母查找 ', v: '', }, { n: 'A ', v: 'A', }, { n: 'B ', v: 'B', }, { n: 'C ', v: 'C', }, { n: 'D ', v: 'D', }, { n: 'E ', v: 'E', }, { n: 'F ', v: 'F', }, { n: 'G ', v: 'G', }, { n: 'H ', v: 'H', }, { n: 'I ', v: 'I', }, { n: 'J ', v: 'J', }, { n: 'K ', v: 'K', }, { n: 'L ', v: 'L', }, { n: 'M ', v: 'M', }, { n: 'N ', v: 'N', }, { n: 'O ', v: 'O', }, { n: 'P ', v: 'P', }, { n: 'Q ', v: 'Q', }, { n: 'R ', v: 'R', }, { n: 'S ', v: 'S', }, { n: 'T ', v: 'T', }, { n: 'U ', v: 'U', }, { n: 'V ', v: 'V', }, { n: 'W ', v: 'W', }, { n: 'X ', v: 'X', }, { n: 'Y ', v: 'Y', }, { n: 'Z ', v: 'Z', }, { n: '0-9 ', v: '0', },], },],
        '24': [{ key: '排序', name: '排序', value: [{ n: '新上线 ', v: 'time', }, { n: '热播榜 ', v: 'hits', }, { n: '好评榜 ', v: 'score', },], }, { key: '字母', name: '字母', value: [{ n: '字母查找 ', v: '', }, { n: 'A ', v: 'A', }, { n: 'B ', v: 'B', }, { n: 'C ', v: 'C', }, { n: 'D ', v: 'D', }, { n: 'E ', v: 'E', }, { n: 'F ', v: 'F', }, { n: 'G ', v: 'G', }, { n: 'H ', v: 'H', }, { n: 'I ', v: 'I', }, { n: 'J ', v: 'J', }, { n: 'K ', v: 'K', }, { n: 'L ', v: 'L', }, { n: 'M ', v: 'M', }, { n: 'N ', v: 'N', }, { n: 'O ', v: 'O', }, { n: 'P ', v: 'P', }, { n: 'Q ', v: 'Q', }, { n: 'R ', v: 'R', }, { n: 'S ', v: 'S', }, { n: 'T ', v: 'T', }, { n: 'U ', v: 'U', }, { n: 'V ', v: 'V', }, { n: 'W ', v: 'W', }, { n: 'X ', v: 'X', }, { n: 'Y ', v: 'Y', }, { n: 'Z ', v: 'Z', }, { n: '0-9 ', v: '0', },], },],
    },
    filter_url: '{{fl.地区}}-{{fl.排序}}-{{fl.剧情}}--{{fl.字母}}---fypage---{{fl.年份}}',
    //filter_def: { '1': { 类型: '1' }, '2': { 类型: '2' }, '3': { 类型: '3' }, '4': { 类型: '4' }, '24': { 类型: '24' } },
    filterable: 1,
    lazy: `js:
            if(/\\.(m3u8|mp4)/.test(input)){
                input = {parse:0,url:input}
            }else{
                if(rule.parse_url.startsWith('json:')){
                    let purl = rule.parse_url.replace('json:','')+input;
                    let html = request(purl);
                    input = {parse:0,url:JSON.parse(html).url}
                }else{
                    input= rule.parse_url+input; 
                }
            `,
    headers: {
        "User-Agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/131.0.0.0 Safari/537.36 Edg/131.0.0.0",
    },
    推荐: '*',
    一级: '.container .flex.desktop-hover-effect;span&&Text;img&&data-original;p.truncate&&Text;a&&href',
    二级: {
        title: '.p-3.mobile&&Text',
        img: 'img&&data-original',
        desc: '.text-sm.py-1&&Text',
        content: '.text-secondary&&Text',
        tabs: '.flex.flex-row.gap-1.items-center',
        lists: '.flex.flex-column.overflow-auto.no-scrollbar&&li',
        tab_text: 'body&&Text',
        list_text: 'a&&Text',
        list_url: 'a&&href',
    },
    double: false,
    搜索: '.col-lg-6.col-md-12.mt-2.mb-2.cursor-pointer;.topic-details-title-sub.text-secondary&&Text;img&&data-original;.topic-details-title&&Text;a&&href',
}