var rule = {
  类型: '影视',//影视|听书|漫画|小说
  title: '漫岛动漫[漫]',
  host: 'https://www.imandaow.com',
  url: '/search.php?page=fypage&searchtype=5&tid=fyclassfyfilter',
  searchUrl: '/search.php?page=fypage&searchword=a&searchtype=',
  searchable: 2,
  quickSearch: 0,
  filterable: 1,
  filter: {
    "1": [
      { "key": "剧情", "name": "剧情", "value": [{ "n": "热血", "v": "热血" }, { "n": "科幻", "v": "科幻" }, { "n": "悬疑", "v": "悬疑" }, { "n": "战斗", "v": "战斗" }, { "n": "恋爱", "v": "恋爱" }, { "n": "冒险", "v": "冒险" }, { "n": "少女", "v": "少女" }, { "n": "后宫", "v": "后宫" }, { "n": "校园", "v": "校园" }, { "n": "搞笑", "v": "搞笑" }, { "n": "奇幻", "v": "奇幻" }, { "n": "治愈", "v": "治愈" }, { "n": "神魔", "v": "神魔" }, { "n": "竞技", "v": "竞技" }, { "n": "运动", "v": "运动" }, { "n": "机战", "v": "机战" }, { "n": "日常", "v": "日常" }, { "n": "励志", "v": "励志" }, { "n": "百合", "v": "百合" }, { "n": "耽美", "v": "耽美" }, { "n": "剧情", "v": "剧情" }, { "n": "玄幻", "v": "玄幻" }] },
      { "key": "年代", "name": "年代", "value": [{ "n": "2025", "v": "2025" }, { "n": "2024", "v": "2024" }, { "n": "2023", "v": "2023" }, { "n": "2022", "v": "2022" }, { "n": "2021", "v": "2021" }, { "n": "2020", "v": "2020" }, { "n": "2019", "v": "2019" }, { "n": "2018", "v": "2018" }, { "n": "2017", "v": "2017" }, { "n": "2016", "v": "2016" }, { "n": "2015", "v": "2015" }, { "n": "2014", "v": "2014" }, { "n": "2013", "v": "2013" }, { "n": "2012", "v": "2012" }, { "n": "2011", "v": "2011" }, { "n": "2010", "v": "2010" }, { "n": "2009", "v": "2009" }, { "n": "更早", "v": "more" }] },
      { "key": "版本", "name": "版本", "value": [{ "n": "TV版", "v": "TV版" }, { "n": "OVA版", "v": "OVA版" }, { "n": "真人版", "v": "真人版" }, { "n": "其它", "v": "其它" }] },
      { "key": "地区", "name": "地区", "value": [{ "n": "地区", "v": "" }, { "n": "日本", "v": "日本" }, { "n": "大陆", "v": "大陆" }, { "n": "欧美", "v": "欧美" }, { "n": "其他", "v": "其他" }] },
      { "key": "排序", "name": "排序", "value": [{ "n": "按最新", "v": "time" }, { "n": "按最热", "v": "hit" }] }],
    "2": [
      { "key": "剧情", "name": "剧情", "value": [{ "n": "热血", "v": "热血" }, { "n": "科幻", "v": "科幻" }, { "n": "悬疑", "v": "悬疑" }, { "n": "战斗", "v": "战斗" }, { "n": "恋爱", "v": "恋爱" }, { "n": "冒险", "v": "冒险" }, { "n": "少女", "v": "少女" }, { "n": "后宫", "v": "后宫" }, { "n": "校园", "v": "校园" }, { "n": "搞笑", "v": "搞笑" }, { "n": "奇幻", "v": "奇幻" }, { "n": "治愈", "v": "治愈" }, { "n": "神魔", "v": "神魔" }, { "n": "竞技", "v": "竞技" }, { "n": "运动", "v": "运动" }, { "n": "机战", "v": "机战" }, { "n": "日常", "v": "日常" }, { "n": "励志", "v": "励志" }, { "n": "百合", "v": "百合" }, { "n": "耽美", "v": "耽美" }, { "n": "剧情", "v": "剧情" }, { "n": "玄幻", "v": "玄幻" }] },
      { "key": "年代", "name": "年代", "value": [{ "n": "2025", "v": "2025" }, { "n": "2024", "v": "2024" }, { "n": "2023", "v": "2023" }, { "n": "2022", "v": "2022" }, { "n": "2021", "v": "2021" }, { "n": "2020", "v": "2020" }, { "n": "2019", "v": "2019" }, { "n": "2018", "v": "2018" }, { "n": "2017", "v": "2017" }, { "n": "2016", "v": "2016" }, { "n": "2015", "v": "2015" }, { "n": "2014", "v": "2014" }, { "n": "2013", "v": "2013" }, { "n": "2012", "v": "2012" }, { "n": "2011", "v": "2011" }, { "n": "2010", "v": "2010" }, { "n": "2009", "v": "2009" }, { "n": "更早", "v": "more" }] },
      { "key": "版本", "name": "版本", "value": [{ "n": "TV版", "v": "TV版" }, { "n": "OVA版", "v": "OVA版" }, { "n": "真人版", "v": "真人版" }, { "n": "其它", "v": "其它" }] },
      { "key": "地区", "name": "地区", "value": [{ "n": "地区", "v": "" }, { "n": "日本", "v": "日本" }, { "n": "大陆", "v": "大陆" }, { "n": "欧美", "v": "欧美" }, { "n": "其他", "v": "其他" }] },
      { "key": "排序", "name": "排序", "value": [{ "n": "按最新", "v": "time" }, { "n": "按最热", "v": "hit" }] }],
    "3": [
      { "key": "剧情", "name": "剧情", "value": [{ "n": "热血", "v": "热血" }, { "n": "科幻", "v": "科幻" }, { "n": "悬疑", "v": "悬疑" }, { "n": "战斗", "v": "战斗" }, { "n": "恋爱", "v": "恋爱" }, { "n": "冒险", "v": "冒险" }, { "n": "少女", "v": "少女" }, { "n": "后宫", "v": "后宫" }, { "n": "校园", "v": "校园" }, { "n": "搞笑", "v": "搞笑" }, { "n": "奇幻", "v": "奇幻" }, { "n": "治愈", "v": "治愈" }, { "n": "神魔", "v": "神魔" }, { "n": "竞技", "v": "竞技" }, { "n": "运动", "v": "运动" }, { "n": "机战", "v": "机战" }, { "n": "日常", "v": "日常" }, { "n": "励志", "v": "励志" }, { "n": "百合", "v": "百合" }, { "n": "耽美", "v": "耽美" }, { "n": "剧情", "v": "剧情" }, { "n": "玄幻", "v": "玄幻" }] },
      { "key": "年代", "name": "年代", "value": [{ "n": "2025", "v": "2025" }, { "n": "2024", "v": "2024" }, { "n": "2023", "v": "2023" }, { "n": "2022", "v": "2022" }, { "n": "2021", "v": "2021" }, { "n": "2020", "v": "2020" }, { "n": "2019", "v": "2019" }, { "n": "2018", "v": "2018" }, { "n": "2017", "v": "2017" }, { "n": "2016", "v": "2016" }, { "n": "2015", "v": "2015" }, { "n": "2014", "v": "2014" }, { "n": "2013", "v": "2013" }, { "n": "2012", "v": "2012" }, { "n": "2011", "v": "2011" }, { "n": "2010", "v": "2010" }, { "n": "2009", "v": "2009" }, { "n": "更早", "v": "more" }] },
      { "key": "版本", "name": "版本", "value": [{ "n": "TV版", "v": "TV版" }, { "n": "OVA版", "v": "OVA版" }, { "n": "真人版", "v": "真人版" }, { "n": "其它", "v": "其它" }] },
      { "key": "地区", "name": "地区", "value": [{ "n": "地区", "v": "" }, { "n": "日本", "v": "日本" }, { "n": "大陆", "v": "大陆" }, { "n": "欧美", "v": "欧美" }, { "n": "其他", "v": "其他" }] },
      { "key": "排序", "name": "排序", "value": [{ "n": "按最新", "v": "time" }, { "n": "按最热", "v": "hit" }] }],
    "4": [
      { "key": "剧情", "name": "剧情", "value": [{ "n": "热血", "v": "热血" }, { "n": "科幻", "v": "科幻" }, { "n": "悬疑", "v": "悬疑" }, { "n": "战斗", "v": "战斗" }, { "n": "恋爱", "v": "恋爱" }, { "n": "冒险", "v": "冒险" }, { "n": "少女", "v": "少女" }, { "n": "后宫", "v": "后宫" }, { "n": "校园", "v": "校园" }, { "n": "搞笑", "v": "搞笑" }, { "n": "奇幻", "v": "奇幻" }, { "n": "治愈", "v": "治愈" }, { "n": "神魔", "v": "神魔" }, { "n": "竞技", "v": "竞技" }, { "n": "运动", "v": "运动" }, { "n": "机战", "v": "机战" }, { "n": "日常", "v": "日常" }, { "n": "励志", "v": "励志" }, { "n": "百合", "v": "百合" }, { "n": "耽美", "v": "耽美" }, { "n": "剧情", "v": "剧情" }, { "n": "玄幻", "v": "玄幻" }] },
      { "key": "年代", "name": "年代", "value": [{ "n": "2025", "v": "2025" }, { "n": "2024", "v": "2024" }, { "n": "2023", "v": "2023" }, { "n": "2022", "v": "2022" }, { "n": "2021", "v": "2021" }, { "n": "2020", "v": "2020" }, { "n": "2019", "v": "2019" }, { "n": "2018", "v": "2018" }, { "n": "2017", "v": "2017" }, { "n": "2016", "v": "2016" }, { "n": "2015", "v": "2015" }, { "n": "2014", "v": "2014" }, { "n": "2013", "v": "2013" }, { "n": "2012", "v": "2012" }, { "n": "2011", "v": "2011" }, { "n": "2010", "v": "2010" }, { "n": "2009", "v": "2009" }, { "n": "更早", "v": "more" }] },
      { "key": "版本", "name": "版本", "value": [{ "n": "TV版", "v": "TV版" }, { "n": "OVA版", "v": "OVA版" }, { "n": "真人版", "v": "真人版" }, { "n": "其它", "v": "其它" }] },
      { "key": "地区", "name": "地区", "value": [{ "n": "地区", "v": "" }, { "n": "日本", "v": "日本" }, { "n": "大陆", "v": "大陆" }, { "n": "欧美", "v": "欧美" }, { "n": "其他", "v": "其他" }] },
      { "key": "排序", "name": "排序", "value": [{ "n": "按最新", "v": "time" }, { "n": "按最热", "v": "hit" }] }],
    "5": [
      { "key": "剧情", "name": "剧情", "value": [{ "n": "热血", "v": "热血" }, { "n": "科幻", "v": "科幻" }, { "n": "悬疑", "v": "悬疑" }, { "n": "战斗", "v": "战斗" }, { "n": "恋爱", "v": "恋爱" }, { "n": "冒险", "v": "冒险" }, { "n": "少女", "v": "少女" }, { "n": "后宫", "v": "后宫" }, { "n": "校园", "v": "校园" }, { "n": "搞笑", "v": "搞笑" }, { "n": "奇幻", "v": "奇幻" }, { "n": "治愈", "v": "治愈" }, { "n": "神魔", "v": "神魔" }, { "n": "竞技", "v": "竞技" }, { "n": "运动", "v": "运动" }, { "n": "机战", "v": "机战" }, { "n": "日常", "v": "日常" }, { "n": "励志", "v": "励志" }, { "n": "百合", "v": "百合" }, { "n": "耽美", "v": "耽美" }, { "n": "剧情", "v": "剧情" }, { "n": "玄幻", "v": "玄幻" }] },
      { "key": "年代", "name": "年代", "value": [{ "n": "2025", "v": "2025" }, { "n": "2024", "v": "2024" }, { "n": "2023", "v": "2023" }, { "n": "2022", "v": "2022" }, { "n": "2021", "v": "2021" }, { "n": "2020", "v": "2020" }, { "n": "2019", "v": "2019" }, { "n": "2018", "v": "2018" }, { "n": "2017", "v": "2017" }, { "n": "2016", "v": "2016" }, { "n": "2015", "v": "2015" }, { "n": "2014", "v": "2014" }, { "n": "2013", "v": "2013" }, { "n": "2012", "v": "2012" }, { "n": "2011", "v": "2011" }, { "n": "2010", "v": "2010" }, { "n": "2009", "v": "2009" }, { "n": "更早", "v": "more" }] },
      { "key": "版本", "name": "版本", "value": [{ "n": "TV版", "v": "TV版" }, { "n": "OVA版", "v": "OVA版" }, { "n": "真人版", "v": "真人版" }, { "n": "其它", "v": "其它" }] },
      { "key": "地区", "name": "地区", "value": [{ "n": "地区", "v": "" }, { "n": "日本", "v": "日本" }, { "n": "大陆", "v": "大陆" }, { "n": "欧美", "v": "欧美" }, { "n": "其他", "v": "其他" }] },
      { "key": "排序", "name": "排序", "value": [{ "n": "按最新", "v": "time" }, { "n": "按最热", "v": "hit" }] }]
  },
  filter_url: '&jq={{fl.剧情}}&area={{fl.地区}}&year={{fl.年代}}&ver={{fl.版本}}&order={{fl.排序}}',
  headers: {
    'User-Agent': 'MOBILE_UA',
  },
  timeout: 5000,
  class_parse: '.nav-down-pc li;a&&Text;a&&href;(\\d+)\.html',
  play_parse: true,
  lazy: $js.toString(() => {
    input = { parse: 1, url: input, js: '' };
  }),
  double: true,
  推荐: '*;li;*;*;*;*',
  一级: '.index-tj li;.li-hv&&title;img&&data-original;.bz&&Text;.li-hv&&href',
  二级: {
    title: '.comicnrr&&a&&Text;.info span&&Text',
    img: 'img&&src',
    desc: 'dd:gt(0):lt(2)&&Text;dd:gt(1):lt(3)&&Text;;dd:gt(2):lt(4)&&Text;dd:gt(4):lt(6)&&Text',
    content: '#quanjq&&Text',
    tabs: '#tab11',
    lists: 'ul.urlli:eq(#id)&&li',
    tab_text: 'body&&Text',
    list_text: 'body&&Text',
    list_url: 'a&&href',
    list_url_prefix: '',
  },
  搜索: '*;*;*;*;*',
}