//网址发布页：hldmdh.top
var rule = {
  类型: '影视',//影视|听书|漫画|小说
  title: '火狼动漫[漫]',
  host: 'https://huolang.vip',
  url: '/iProId/fyclass-fyfilter.html',
  searchUrl: '/search/**/fypage.html',
  searchable: 2,
  quickSearch: 0,
  filterable: 1,
  filter: {
    "2": [
      { "key": "类型", "name": "类型", "value": [{ "n": "全部", "v": "" }, { "n": "喜剧", "v": "喜剧" }, { "n": "爱情", "v": "爱情" }, { "n": "动作", "v": "动作" }, { "n": "科幻", "v": "科幻" }, { "n": "悬疑", "v": "悬疑" }, { "n": "犯罪", "v": "犯罪" }, { "n": "惊悚", "v": "惊悚" }, { "n": "冒险", "v": "冒险" }, { "n": "奇幻", "v": "奇幻" }, { "n": "恐怖", "v": "恐怖" }, { "n": "战争", "v": "战争" }, { "n": "武侠", "v": "武侠" }, { "n": "动画", "v": "动画" }, { "n": "少儿", "v": "少儿" }, { "n": "全部", "v": "" }] },
      { "key": "年代", "name": "年代", "value": [{ "n": "全部", "v": "" }, { "n": "2024", "v": "2024" }, { "n": "2023", "v": "2023" }, { "n": "2022", "v": "2022" }, { "n": "2021", "v": "2021" }, { "n": "2020", "v": "2020" }, { "n": "2019", "v": "2019" }, { "n": "2018", "v": "2018" }, { "n": "2017", "v": "2017" }, { "n": "2016", "v": "2016" }, { "n": "2015", "v": "2015" }, { "n": "2014", "v": "2014" }, { "n": "2013", "v": "2013" }, { "n": "2012", "v": "2012" }, { "n": "2011", "v": "2011" }, { "n": "2010-2000", "v": "20002010" }, { "n": "90年代", "v": "19901999" }, { "n": "更早", "v": "18001989" }] }],
    "3": [
      { "key": "类型", "name": "类型", "value": [{ "n": "全部", "v": "" }, { "n": "喜剧", "v": "喜剧" }, { "n": "爱情", "v": "爱情" }, { "n": "动作", "v": "动作" }, { "n": "科幻", "v": "科幻" }, { "n": "悬疑", "v": "悬疑" }, { "n": "犯罪", "v": "犯罪" }, { "n": "惊悚", "v": "惊悚" }, { "n": "冒险", "v": "冒险" }, { "n": "奇幻", "v": "奇幻" }, { "n": "恐怖", "v": "恐怖" }, { "n": "战争", "v": "战争" }, { "n": "武侠", "v": "武侠" }, { "n": "动画", "v": "动画" }, { "n": "少儿", "v": "少儿" }, { "n": "全部", "v": "" }] },
      { "key": "年代", "name": "年代", "value": [{ "n": "全部", "v": "" }, { "n": "2024", "v": "2024" }, { "n": "2023", "v": "2023" }, { "n": "2022", "v": "2022" }, { "n": "2021", "v": "2021" }, { "n": "2020", "v": "2020" }, { "n": "2019", "v": "2019" }, { "n": "2018", "v": "2018" }, { "n": "2017", "v": "2017" }, { "n": "2016", "v": "2016" }, { "n": "2015", "v": "2015" }, { "n": "2014", "v": "2014" }, { "n": "2013", "v": "2013" }, { "n": "2012", "v": "2012" }, { "n": "2011", "v": "2011" }, { "n": "2010-2000", "v": "20002010" }, { "n": "90年代", "v": "19901999" }, { "n": "更早", "v": "18001989" }] }],
    "4": [
      { "key": "类型", "name": "类型", "value": [{ "n": "全部", "v": "" }, { "n": "喜剧", "v": "喜剧" }, { "n": "爱情", "v": "爱情" }, { "n": "动作", "v": "动作" }, { "n": "科幻", "v": "科幻" }, { "n": "悬疑", "v": "悬疑" }, { "n": "犯罪", "v": "犯罪" }, { "n": "惊悚", "v": "惊悚" }, { "n": "冒险", "v": "冒险" }, { "n": "奇幻", "v": "奇幻" }, { "n": "恐怖", "v": "恐怖" }, { "n": "战争", "v": "战争" }, { "n": "武侠", "v": "武侠" }, { "n": "动画", "v": "动画" }, { "n": "少儿", "v": "少儿" }, { "n": "全部", "v": "" }] },
      { "key": "年代", "name": "年代", "value": [{ "n": "全部", "v": "" }, { "n": "2024", "v": "2024" }, { "n": "2023", "v": "2023" }, { "n": "2022", "v": "2022" }, { "n": "2021", "v": "2021" }, { "n": "2020", "v": "2020" }, { "n": "2019", "v": "2019" }, { "n": "2018", "v": "2018" }, { "n": "2017", "v": "2017" }, { "n": "2016", "v": "2016" }, { "n": "2015", "v": "2015" }, { "n": "2014", "v": "2014" }, { "n": "2013", "v": "2013" }, { "n": "2012", "v": "2012" }, { "n": "2011", "v": "2011" }, { "n": "2010-2000", "v": "20002010" }, { "n": "90年代", "v": "19901999" }, { "n": "更早", "v": "18001989" }] }],
    "5": [
      { "key": "类型", "name": "类型", "value": [{ "n": "全部", "v": "" }, { "n": "喜剧", "v": "喜剧" }, { "n": "爱情", "v": "爱情" }, { "n": "动作", "v": "动作" }, { "n": "科幻", "v": "科幻" }, { "n": "悬疑", "v": "悬疑" }, { "n": "犯罪", "v": "犯罪" }, { "n": "惊悚", "v": "惊悚" }, { "n": "冒险", "v": "冒险" }, { "n": "奇幻", "v": "奇幻" }, { "n": "恐怖", "v": "恐怖" }, { "n": "战争", "v": "战争" }, { "n": "武侠", "v": "武侠" }, { "n": "动画", "v": "动画" }, { "n": "少儿", "v": "少儿" }, { "n": "全部", "v": "" }] },
      { "key": "年代", "name": "年代", "value": [{ "n": "全部", "v": "" }, { "n": "2024", "v": "2024" }, { "n": "2023", "v": "2023" }, { "n": "2022", "v": "2022" }, { "n": "2021", "v": "2021" }, { "n": "2020", "v": "2020" }, { "n": "2019", "v": "2019" }, { "n": "2018", "v": "2018" }, { "n": "2017", "v": "2017" }, { "n": "2016", "v": "2016" }, { "n": "2015", "v": "2015" }, { "n": "2014", "v": "2014" }, { "n": "2013", "v": "2013" }, { "n": "2012", "v": "2012" }, { "n": "2011", "v": "2011" }, { "n": "2010-2000", "v": "20002010" }, { "n": "90年代", "v": "19901999" }, { "n": "更早", "v": "18001989" }] }]
  },
  filter_url: '{{fl.类型}}--{{fl.年代}}---addtime-fypage',
  headers: {
    'User-Agent': 'MOBILE_UA',
  },
  timeout: 5000,
  class_parse: '.nav li;a&&Text;a&&href;/(\\d+)/',
  cate_exclude: '',
  play_parse: true,
  lazy: $js.toString(() => {
    input = { parse: 1, url: input, js: '' };
  }),
  double: true,
  推荐: '.tab-pane ul li;li;*;*;.col-sm-2 p&&Text;.image a&&href',
  一级: '.vod-item-img li;h3&&Text;.img-responsive&&data-original;.col-md-2&&p&&Text;.col-md-2 a&&href',
  二级: {
    title: 'h1&&Text;.media-body&&li:eq(1)&&Text',
    img: '.media-object&&src',
    desc: '.media-body&&li:eq(0)&&Text;.media-body&&li:eq(4)&&Text;.media-body&&li:eq(5)&&Text;.media-body&&li:eq(3)&&Text;.media-body&&li:eq(2)&&Text',
    content: '.vod-content&&Text',
    tabs: '.ff-playurl-tab&&li',
    lists: 'ul.list-unstyled:eq(#id)&&li',
    tab_text: 'body&&Text',
    list_text: 'body&&Text',
    list_url: 'a&&href',
    list_url_prefix: '',
  },
  搜索: '.vod-item-img&&li;h3&&Text;.img-responsive&&data-original;.col-md-2&&p&&Text;.col-md-2 a&&href',
}